In [1]:
# The Pearsonâ€™s chi-squared statistical hypothesis is an example of 
#a test for independence between categorical variables.

In [2]:
#        Science,	Math,	Art
#Male         20,      30,    15
#Female       20,      15,    30

# Historically, 
#a table summarization of two categorical variables in this form is called a contingency table.
#stat, p, dof, expected = chi2_contingency(table)

#Historically, 
#a table summarization of two categorical variables in this form is called a contingency table.

In [3]:
# chi-squared test with similar proportions
from scipy.stats import chi2_contingency
from scipy.stats import chi2
# contingency table
table = [	[10, 20, 30],
			[6,  9,  17]]
print(table)

[[10, 20, 30], [6, 9, 17]]

In [4]:
stat, p, dof, expected = chi2_contingency(table)
print('dof=%d' % dof)
print(expected)

dof=2
[[10.43478261 18.91304348 30.65217391]
 [ 5.56521739 10.08695652 16.34782609]]

In [5]:
print(stat)
print(p)

0.27157465150403504
0.873028283380073

In [6]:
# interpret test-statistic
prob = 0.95
critical = chi2.ppf(prob, dof)
print('probability=%.3f, critical=%.3f, stat=%.3f' % (prob, critical, stat))
if abs(stat) >= critical:
	print('Dependent (reject H0)')
else:
	print('Independent (fail to reject H0)')

probability=0.950, critical=5.991, stat=0.272
Independent (fail to reject H0)

In [7]:
# interpret p-value
alpha = 1.0 - prob
print('significance=%.3f, p=%.3f' % (alpha, p))
if p <= alpha:
	print('Dependent (reject H0)')
else:
	print('Independent (fail to reject H0)')

significance=0.050, p=0.873
Independent (fail to reject H0)

In [39]:
# Data Manupulation
import numpy as np
import pandas as pd
# Plotting graphs
import matplotlib.pyplot as plt

# CSV File - Read
df = pd.read_csv('C:\\Users\\hp\\Downloads\LGD_DATA.csv')
#  ,header=None ,skiprows=1 , names=['Cal', 'Pr', 'Fat', 'sod', 'Fib', 'Rting']
print(df.head(5)) 
print(df.ndim)
print(df.shape)

    Ac_No  Age  Years of Experience  Number of Vehicles Gender  Married  \
0  150024   24                    5                   1      M  Married
1  144880   31                   10                   1      F   Single
2  133742   56                   37                   1      M  Married
3  151282   52                   31                   1      F  Married
4  174407   20                    3                   1      M   Single

   Losses in Thousands
0           203.319595
1           402.197302
2           553.132096
3           292.430579
4           246.540576
2
(15290, 7)

In [14]:
Gen_mar = pd.crosstab(df['Gender'], df['Married'], margins = False)

In [15]:
Gen_mar

Married  Married  Single
Gender
F           3974    3773
M           3809    3734

In [17]:
stat, p, dof, expected = chi2_contingency(Gen_mar)
print('dof=%d' % dof)
print(stat)
print(p)

dof=1
0.9472609520907108
0.3304174796955742

In [18]:
Gen_mar = pd.crosstab(df['Gender'], df['Losses in Thousands'], margins = False)

In [20]:
#Gen_mar

In [31]:
# A simple function like pd.cut can transfer continuous values into categorical values.

#set up bins
bin = [200,500,1000,3000]
#use pd.cut function can attribute the values into its specific bins
category = pd.cut(df['Losses in Thousands'],bin)
category = category.to_frame()
category.columns = ['range']
#concatenate age and its bin
df_new = pd.concat([df,category],axis = 1)

In [32]:
df_new.head()

,Ac_No,Age,Years of Experience,Number of Vehicles,Gender,Married,Losses in Thousands,range
0,150024,24,5,1,M,Married,203.319595,"(200, 500]"
1,144880,31,10,1,F,Single,402.197302,"(200, 500]"
2,133742,56,37,1,M,Married,553.132096,"(500, 1000]"
3,151282,52,31,1,F,Married,292.430579,"(200, 500]"
4,174407,20,3,1,M,Single,246.540576,"(200, 500]"

In [41]:
bins = [0,500,1000,1500]
labels = ["poor","normal","excellent"]
df['LTH_Category'] = pd.cut(df['Losses in Thousands'], bins=bins, labels=labels)

In [42]:
df.head()

,Ac_No,Age,Years of Experience,Number of Vehicles,Gender,Married,Losses in Thousands,LTH_Category
0,150024,24,5,1,M,Married,203.319595,poor
1,144880,31,10,1,F,Single,402.197302,poor
2,133742,56,37,1,M,Married,553.132096,normal
3,151282,52,31,1,F,Married,292.430579,poor
4,174407,20,3,1,M,Single,246.540576,poor

In [43]:
Gen_mar = pd.crosstab(df['Gender'], df['LTH_Category'], margins = False)
Gen_mar

stat, p, dof, expected = chi2_contingency(Gen_mar)
print('dof=%d' % dof)
print(stat)
print(p)

dof=2
477.8440829620165
1.727729623698595e-104

In [44]:
Gen_mar

LTH_Category  poor  normal  excellent
Gender
F             6446    1257         35
M             5217    2013        266

In [47]:
######## Z _ test

import pandas as pd
from scipy import stats
from statsmodels.stats import weightstats as stests
ztest ,pval = stests.ztest(df['Losses in Thousands'], x2=None, value=350)
print(float(pval))
if pval<0.05:
    print("reject null hypothesis")
else:
    print("accept null hypothesis")

4.71877154589761e-84
reject null hypothesis

In [46]:
df['Losses in Thousands'].describe()

count    15290.000000
mean       389.859718
std        253.729433
min         12.534521
25%        226.434217
50%        354.937874
75%        488.676927
max       3500.000000
Name: Losses in Thousands, dtype: float64

In [53]:
ztest ,pval1 = stests.ztest(df['Losses in Thousands']/10, x2=df['Age'], value=0,alternative='two-sided')
print(float(pval1))
if pval<0.05:
    print("reject null hypothesis")
else:
    print("accept null hypothesis")

7.135409991920064e-40
reject null hypothesis